In [15]:
import pandas as pd
import numpy as np

In [4]:
data = pd.io.stata.read_stata('replication_data.dta')

In [44]:
data.count()[0]

3378291

In [51]:
data.columns

Index(['year', 'sex', 'age', 'marst', 'bpl', 'bpld', 'citizen', 'yrimmig',
       'yrsusa1', 'speakeng', 'educd', 'degfield', 'wkswork2', 'uhrswork',
       'incwage', 'educ', 'lowgdp', 'colony', 'brcol', 'frcol', 'saharan',
       'simul_wages'],
      dtype='object')

In [9]:
eleven_states = ['Washington','New York','Maryland','California','Georgia','Minnesota','Massachusetts','Texas','Virginia','New Jersey','Illinios']
sub_saharan = [191148,150424,146092,138654,95422,93071,92008,91228,83864,67128,63499]
salary = [63680,40460,40710,38920,32510,37390,43830,32880,29040,40250,35720]

In [53]:
df = pd.DataFrame({'Eleven States': eleven_states, 'Sub Saharan African Population': sub_saharan, 'Median State Salary': salary})
df

    Eleven States  Sub Saharan African Population  Median State Salary
0      Washington                          191148                63680
1        New York                          150424                40460
2        Maryland                          146092                40710
3      California                          138654                38920
4         Georgia                           95422                32510
5       Minnesota                           93071                37390
6   Massachusetts                           92008                43830
7           Texas                           91228                32880
8        Virginia                           83864                29040
9      New Jersey                           67128                40250
10       Illinios                           63499                35720

In [56]:
# Creating probability distribution
p = [i/sum(sub_saharan) * 100 for i in sub_saharan]
df["p"] = p
df

,Eleven States,Sub Saharan African Population,Median State Salary,p
0,Washington,191148,63680,15.764289
1,New York,150424,40460,12.405714
2,Maryland,146092,40710,12.048447
3,California,138654,38920,11.435023
4,Georgia,95422,32510,7.869609
5,Minnesota,93071,37390,7.675718
6,Massachusetts,92008,43830,7.588051
7,Texas,91228,32880,7.523723
8,Virginia,83864,29040,6.916402
9,New Jersey,67128,40250,5.536156
10,Illinios,63499,35720,5.236867

In [ ]:
p

In [49]:
simul_wages = [np.random.choice(df["Median State Salary"], p=p) for i in range(data.count()[0])]

In [50]:
data["simul_wages"] = simul_wages
data = data[["simul_wages"]]
data.to_stata("modified_replication_data.dta")

/Users/matthewtaruno/anaconda3/lib/python3.6/site-packages/pandas/io/stata.py:687: ValueLabelTypeMismatch:
Stata value labels (pandas categories) must be strings. Column yrsusa1 contains
non-string labels which will be converted to strings.  Please check that the
Stata data file created has not lost information due to duplicate labels.

  ValueLabelTypeMismatch,